{
  "1639374663": {
    "title": "English Grammar: Learning at Lightning Speed",
    "author": "Okon Attah",
    "desc": "English Grammar: Learning at Lightning Speed By: Okon Attah, Ph.D. English Grammar: Learning at Lightning Speed is part of a collective effort to water the flower of grammar and maintain its wholesomeness. This book is neither the ultimate nor the penultimate work on English grammar; it is intended to serve as a prolegomenon to further studies. Verbosity has been reduced here; there is focus on what is germane to understanding English grammar, so the reader can learn at lightning speed."
  },
  "1973833204": {
    "title": "Amos The Gifted",
    "author": "Wilbur Shapiro",
    "desc": "Amos was abandoned by his father at birth. His mother, Soriana vowed to provide Amos everything in life for him to succeed. Amos was gifted. Unfortunate circumstances landed Soriana and her son in a farming community in New Hampshire. It was there that Amos made his mark and lived up to his calling."
  },
  "9798893412123": {
    "title": "The Second World War as Experienced by a British Schoolboy",
    "author": "Dr. Douglas M. Gebbie",
    "desc": "At ten years old, young Douglas M. Gebbie witnessed the igniting spark of World War II firsthand. As Douglas and his family listen intently to the BBC radio broadcast, the world-altering news rings out: Hitler has invaded Poland. In the town of Hull in Yorkshire, England, Douglas's father serves as The Medical Officer of Health, a position of major responsibility as he is to ensure safety across two hospitals, organize the ambulance service, and oversee the quality of the water supply and the elimination of sewage. With the country thrown into a tailspin, the Gebbie family must learn to adapt to a new reality-one with shortages, rations, and raids. As a teenager shaped by the events of WWII, Douglas Gebbie offers a vital account of the era, a perspective that uniquely captures the reality of families and children during a most significant time in world history. About the Author Born in Stockport, England, Douglas M. Gebbie is a retired physician. A graduate of the University of Glasgow, Gebbie served two years in the Royal Navy before emigrating to Newfoundland to be a general practitioner. After returning to school, he became an anesthesiologist and a lecturer at the University of Toronto and, later, the University of Cincinnati. Gebbie and his wife have four children together. Additionally, he is the author of four books, two of which are children's books. Now retired, Gebbie resides in Naples, Florida."
  },
  "9798887290683": {
    "title": "The Adventures of Morag and Willow",
    "author": "Dr. Douglas M. Gebbie",
    "desc": "The Adventures of Morag and Willow Douglas M. Gebbie Morag, a little terrier, and Willow, a large, retired racing greyhound, are two dogs that live together but have very different backgrounds. As they talk and grow closer as friends, they learn how humans live along with some life lessons. About the Author Douglas M. Gebbie is a medical graduate of Glasgow University who is now retired. As a physician, he served two years in the Royal Navy before starting his professional career as a general practitioner, first in a remote part of Newfoundland and then in Brampton, Ontario where he returned to school to become an anesthesiologist. He became a lecturer at Toronto University, then a professor at the University of Cincinnati. He was married and has four children, a boy and three girls. He now resides in Naples, FL and looks after Morag, who is the sweetest, happiest terrier imaginable. Willow belongs to a close family friend named Lesley."
  },
  "9798890278111": {
    "title": "More Adventures of Morag and Willow",
    "author": "Dr. Douglas M. Gebbie",
    "desc": "About the Book Morag, a little terrier, and Willow, a large, retired racing greyhound, are two dogs that live together but have very different backgrounds. As they talk and grow closer as friends, they learn how humans live along with some life lessons. About the Author Douglas M. Gebbie is a medical graduate of Glasgow University who is now retired. As a physician, he served two years in the Royal Navy before starting his professional career as a general practitioner, first in a remote part of Newfoundland and then in Brampton, Ontario where he returned to school to become an anesthesiologist. He became a lecturer at Toronto University, then a professor at the University of Cincinnati. He was married and has four children, a boy and three girls. He now resides in Naples, FL and looks after Morag, who is the sweetest, happiest terrier imaginable. Willow belongs to a close family friend named Lesley."
  },
  "1957208384": {
    "title": "Think About These Things: The Heavenly Mind",
    "author": "Tom Kingery",
    "desc": "God has a mind. Created in God's likeness, we too have a mind. God has thoughts, and we do too. How wonderful to think about what God thinks. How awesome the depths. How glorious the heights. How perfect the perceptions. Yet what about when our thoughts turn to sin?"
  },
  "1973675757": {
    "title": "Supplement Your Faith: A Pathway to Integrity",
    "author": "Tom Kingery",
    "desc": "\"Salvation is important. But once we experience saving grace, we have only just begun. There is more. There is sanctifying grace. It is the grace that moves us beyond accepting Jesus as Lord into a deeper discipleship, into fruit-bearing followers. Spiritual growth is important for believers. 'God has given us everything we need for a godly life.' (2 Peter 1: 3) We can supplement our faith with seven character traits: goodness (or virtue), knowledge, self control, perseverance, godliness, mutual affection, and love. As we strive for perfection (Philippians 3:12-14), our witness will be enhanced, our spiritual life will deepen, our lights will shine brighter, longer, more consistently and more purely, and the grace of God will enrich us in our journeys. There is a path laid out for us here, and I want to take it, examine it more closely, and share it. I am not perfect, and I know it very well, but I want to do better, I want to increase! I want to grow! I want to go forward!\" Supplement Your Faith: A Pathway to Integrity takes us on a course that encourages us to pursue seven particular qualities, or, character traits that enable us to be effective and productive in our knowledge of our Lord Jesus Christ. (2 Peter 1:8) These qualities, according to Peter, are important for our journeys. Believers need these character traits. Rediscover them in these pages."
  },
  "1639373756": {
    "title": "She Could Be You",
    "author": "Margaret Joeline Brinson",
    "desc": "She Could Be You By: Margaret Joeline Brinson We all have feelings that we may or may not take time to assess. These poems were written to express and convey these feelings. Even though actions speak louder than words; words help us face the challenges we are dealing with in our lives: time, racism, inequality, injustice, independence, as well as peace, love, and mortality."
  },
  "1546215107": {
    "title": "Little A: The Dreamer",
    "author": "John Chipley",
    "desc": "This is a book about a thirteen-year-old African American boy; his best friend, Enoch; and a man known as Mr. Snake. It is about becoming president of the United States."
  },
  "1647536634": {
    "title": "Little A and the Womack",
    "author": "John Chipley",
    "desc": null
  },
  "1546268103": {
    "title": "Little A and Uncle Thomas",
    "author": "John Chipley",
    "desc": "I have read all six Little A books, and they are all fun to read. However, Uncle Thomas is a very special Little A adventure book. If you are an African American boy, white boy, or even a pink boy (it doesn't matter) between the ages of nine and fourteen, this is a book just for you. This is a must-read about a young boy and his coming of age. This is a must-read."
  },
  "1684862434": {
    "title": "Little A and Please, Help Me: An African American Boy's Cry",
    "author": "John Chipley",
    "desc": "This story takes place in the inner-city of Memphis, a neighborhood called Bingharnpton. It's a neighborhood full of crime and poverty. So yes, it has gangs and some street language but It's also full of courage and love and wisdom. This book will help open doors for you to talk with your son or grandson about important things, things like feelings, anger, and love. It will help him have the courage to ask you the hard questions, maybe embarrassing questions, maybe questions that might save his life. Boys today are growing up in a world full of hate and mass-media false information. Our boys, your boys need to know that it is okay to ask questions about anything. This book will help both of you open doors of communication and trust. It is a book parents should read. It's a book boys must read."
  },
  "1962142221": {
    "title": "The Pearl Drop Killer",
    "author": "Joshua Quentin Hawk",
    "desc": "Jackson Hole County is about to be woken up from its long unsympathetic past. Forensic Psychologist, and Investigator, T.K. Donovan returns to help his old partners and town when a new serial killer starts dumping young womens bodies. Fourteen young women have turned up dead in the Sherman forest, near the Sherman Estates, which now involves the old family with its dark and scandals past. Donovan and the Jackson Hole Sheriffs department must follow the clues, which are nearly identical to a case his father worked thirty years ago. But because of old biases and bigotry, as well as backward thinking, it had cost his father his life and could cost him his too. In the process, Donovan will dig into old family histories, secrets, and long dead skeletons, at the same time inquire into the current dark private sultry side of the community. Will he be able to solve the case before the Sherriff closes it as he did thirty years ago, and save his daughters in the process? It could rock the town, but hopefully not break it, and finally bring it into the twentieth-first century even if it does not want it."
  },
  "1546273360": {
    "title": "The Lost Outpost",
    "author": "Joshua Quentin Hawk",
    "desc": "In the Earth year 2260, Commander Daniel Bowers, a renowned environmental planetary scientist and archeologist, leads a team of explorers to a newly discovered planet for possible colonization and habitation due to overpopulation and environmental degradation of both Earth and Mars, but now he has awakened an ancient force and shot forward in time. Now, in the year 2273, Bowers has landed right in the middle of a coup and conspiracy by the Earth president and his ex-admiral, his former commander. Both do not care whom they hurt and wish to use the newly acquired alien technology, which they found in the Andromeda Galaxy, for their own profit and power. This brings Bowers right back into the middle of his ex-admiral's newest agenda. To complete his original mission, to save Earth and Mars, Bowers will need to stop his ex-admiral, the coup, and the ancient force he has awoken. First, he must remember who he is, from his memory loss, because of the lost time due to losing the ten years. Bowers and his new team, one at first that does not accept him for who is and believes he is causing the calamities and not the ancient force or his ex-admiral, must now work together. As the conspiracy unfolds, will a current admiral and old family friends learn in time what is going on and help him stop the ancient force and the coup and to complete his original mission to help Earth and Mars?"
  },
  "1665592303": {
    "title": "Vlad: The Dark Prince",
    "author": "Colin Martin",
    "desc": "For years, Vlad had fought enemies to defend his realm, his people and his religion. And to honour his father and keep the Order of the Dragon, he had battled through extreme bloodshed, his cunning and defiance prevailing. But the Turks were advancing in increased numbers. With only his family, a depleted army and a group of travellers to entrust, would he be defeated, captured and tortured; or had he a darker option?"
  },
  "1475956932": {
    "title": "We'll All Die as Marines",
    "author": "Jim Bathurst",
    "desc": "For seventeen-year-old high school dropout Jim Bathurst, the Marine Corps's reputation for making men out of boys was something he desperately needed when he enlisted in March of 1958. What began as a four-year hitch lasted nearly thirty-six years and included an interesting assortment of duty stations and assignments as both enlisted and officer. We'll All Die As Marines narrates a story about a young, free-spirited kid from Dundalk, Maryland, and how the Corps captured his body, mind, and spirit. Slowly, but persistently, the Corps transformed him into someone whose first love would forever be the United States Marine Corps. It documents not only his leadership, service, and training but also regales many tales of his fellow Marines that will have the reader laughing, cheering, and at times crying. In this memoir, Bathurst reveals that for him-a former DI who was awarded the Silver Star, Bronze Star Medal with Combat \"V,\" Purple Heart, and a combat commission to second lieutenant-the Corps was not a job, a career, or even a profession; it was-and still is-a way of life."
  },
  "1982215054": {
    "title": "Freda and Todd Find Each Other",
    "author": "Dr. Clare Z",
    "desc": "An elder lizard couple was reincarnated into a world very different from their life in the desert. They expected to be together once again but lost each other along the way. Sadness and a sense of something missing led them to search for that missing something."
  },
  "1664233458": {
    "title": "Rooted by the Water",
    "author": "Shannon Kenley Hinson",
    "desc": "Although life is full of uncertainties, how it is unveiled lies in the eye of the beholder. But what if that view of life is clouded by disability? In a heartwarming testament of the goodness of God, Shannon Kenley Hinson shares insight into her experiences navigating disability challenges and other struggles while providing a candid glimpse into the lessons she learned along the way. Born with a birth defect that affected both her optic nerves, Shannon chronologically discloses how God's strength was made perfect in her weaknesses as she set out on a coming-of-age journey that was different than most. While dealing with both hearing and vision losses, Shannon reveals how she learned to watch for signs of divine grace, rely on God for strength, and persevere through seemingly insurmountable obstacles to sing a song of gratitude and praise, and ultimately bloom wherever she was planted. Rooted by the Water shares the true story of one woman's ongoing journey of learning and self-discovery as she grew spiritually to witness all of God's glory despite her disabilities."
  },
  "1477118748": {
    "title": "The Tale of Inkey Pinkey Forest",
    "author": "Helen Ridling",
    "desc": "The Tale of the Inkey Pinkey Forest is a bed time story designed for busy adults to read to their children. The chapters make it easy to break the length of story time without compromising the story. The story is about love, forgiveness and what matters most. Friendship and love work together to help a Princess and her treasured dinosaur overcome the tragedy of the Inkey Pinkey Forest. Like all good stories there is a happy ending."
  },
  "1728380200": {
    "title": "Chocolate Verselets: Poems",
    "author": "Priscilla Mulenga Campbell",
    "desc": "Come with me and share this journey life takes us on. These poems are written from deep within the heart sparing nothing. I mean to inspire and encourage. To reach out and touch any soul that needs to be touched, anyone that needs one to just say hey, I understand. May the reader through these verselets find common ground and comfort knowing there's someone out there who just understands."
  },
  "1742845401": {
    "title": "Cockabloodytoo",
    "author": "Jay Arbee",
    "desc": "Cockabloodytoo is a pacey thriller/comedy following the exploits of a cast of intriguing characters. The Distinctly Australian take on a Bond-esque secret service organization is a unique feature of this work. The novel uses real settings, primarily rural locations around Melbourne, The cockatoo, Bruce, who appears throughout the story, provides the story with yet another unique feature. It is energetic and the story is certainly an unusual one. Over the early chapters an unlikely team are brought together. The introduction of Bruce, then Doc and Pete, as the story begins, sets the tone well for the rest of the novel. The characters are a recognizable and likeable bunch, adding to the lively good humour of the story. The main character Ron, is anti-drugs, smuggling, ( especially wildlife), enjoys a good scrap, Inadvertently he stumbles onto a bird smuggling racket and by rescuing a cockatoo stuck in a net set up by two seemingly inept country lads, catching the birds to make extra cash. Whom Ron subsequently recruits to go after the head honchos of the ring. After a couple of gun battles they discover that the smugglers are also well established in the Meth amphetamine drug market. Following some random clues given to Ron by the dying boss of the bird smugglers, he finally works out that there will be a large drug drop by sea. he makes plans with the aid of further recruits, to disrupt the landing and seize the drugs. Lying low in Geelong until they know just what the scenario is. Eventually they return to Melbourne and discover that the head of the drug ring has kidnapped the Matriarch. Once again they set out on a seek and destroy mission to rescue the old lady \""
  },
  "1736763857": {
    "title": "Can't See Around Corners",
    "author": "Josie Townsend",
    "desc": "Born into opulent wealth, Sharon and Annie were the only children of Edna and Warren Karce, and the girls were the pride and joy of their parents. The fraternal twins had accomplished studying for their degrees and eagerly looked forward to their once-in-a-lifetime overseas trip to Europe. The sisters' love for each other was obvious to the bystander, but a sinister undercurrent of malicious feelings dwelled profoundly beneath their facade of shared contentment, penetrating treachery, deceit, and wickedness that developed intensely between them. Once abroad, with their overprotective parents absent, their relationship advances into the vilest possible nightmare, changing their lives forever. How will the highly famed socialite dynasty survive the unforeseen scandalous and degrading impacts created by the once idolized and respected twin daughters of the Karce Empire?"
  },
  "0968497608": {
    "title": "Broken Wings",
    "author": "Nattanya Andersen",
    "desc": "After surviving a mid-flight engine explosion in 1988, a flight attendant is diagnosed with post-traumatic stress disorder but uncovers even more health hazards in the airline industry as she struggles to reclaim her job."
  },
  "0968497659": {
    "title": "The Post Traumatic Stress Disorder Fallacy",
    "author": "Nattanya Andersen",
    "desc": "When a Boeing 727 engine explodes five feet away from her, flight attendant Nattanya Andersen is thrown into the surprisingly unscrupulous world of the mental health industry. As one of the few to escape its grasp with her faculties still intact, Andersen reveals the secrets that mental health practitioners don't want you to know.Meticulously researched, \"The Post Traumatic Stress Disorder Fallacy\" shines a light on an industry that defies scrutiny. In the process it reveals a shocking truth about PTSD that few people know, and still fewer will tell.At age 28, Nattanya Andersen became a flight attendant. At age 45, she had survived numerous near misses in the air and on the ground. Diagnosed with PTSD, she made use of her forced retirement to tell her story as author of \"Broken Wings\". After over a decade of \"treatment\", she's ready to reveal secrets that might help you-and could get her killed.This book is MUST READING for anyone who has been diagnosed with PTSD. It reveals the shocking deep secrets the mental health industry and the military-industrial complex does NOT want you to know!"
  },
  "0968497675": {
    "title": "Serving Evil",
    "author": "Nattanya Andersen",
    "desc": "A lengthy thought-provoking journey into one woman's experience and extensive research into PTSD. \"Diagnosed with Post Traumatic Stress Disorder after, by a hair's breath, escaping being blown out of the sky, 23 Workers Compensation Board and airline-employed psychiatrists and psychologists attempted to drive me into suicide. With the help of an Irish psychiatrist, I survived 10 years of that corporate traumatization. Many years later, when I discovered that genuine PTSD experiencers' do not recover, when under the 'care' of mental health professionals, I decided to find out Why.\" Nattanya H. Nattanya Andersen conducted a massive amount of research into PTSD and the shocking implications of sufferers following the path of blind acceptance in their desperate quest for relief from their condition. Told from her personal perspective-a flight attendant who watched her plane blow up right before her eyes-Andersen recounts how the powers that be want to sweep you and your PTSD under the rug rather than do everything they can to assist you in reclaiming your life. \"Absolutely and utterly fascinating-a riveting exposé on a topic non-sufferers generally do not give a second's thought to.\" If you ever wondered whether doctors, hospitals and the pharmaceutical industry prefer to cure you or to keep you sick and keep treating you, H. Nattanya Andersen has an answer for you, at least in the field of mental health. Keeping you sick and treating you is clearly more profitable!"
  },
  "9798998658228": {
    "title": "It's All Connected",
    "author": "Boots / Zakrajsek",
    "desc": null
  },
  "1984559974": {
    "title": "Five Things I've Learned About Working in Nursing",
    "author": "Ana Lydia Peeks",
    "desc": "This book is not scientific in nature nor is it heavily embedded with literature or references on the aging process. Instead, I share my reflections about themes that emerged in my work as a professional in a nursing home. At times, I will share my own experiences to illustrate a point. This book is written as an invitation to guide readers to lift the veil into what could be viewed as a complex process-that is, the aging process. While we are all headed toward this developmental benchmark as we grow older; the path of aging influences us all. This book is not psychotherapy, and residents are not identified as case studies. Rather, the aim of this book is for readers to reflect on the themes highlighted in each chapter. It is as if we are sitting together and exchanging viewpoints about the various thematic chapters in this book. In each chapter, I use metaphors to underscore my observations. The book's format is divided into chapters. Each chapter has a title and a subtitle describing each theme as a jewel. To understand this, picture yourself sitting in your favorite chair with a cup of tea and reading a chapter in this book. Questions poised in the chapters in this book are questions that I reflected on in my own discovery about aging, and thus, I feel compelled to share them with you. Since a jewel is the subtitle of each chapter, why not experiment and develop your own treasure chest? There are numerous arts and crafts stores that carry boxes that can be decorated to resemble a treasure chest, as we all have the ability to be creative. Further, as part of this process, consider choosing a favorite color or colors as your own personal jewel(s), place it inside your personalized treasure chest, and pour your hopes, dreams, and aspirations onto it. It is surprising what this process may reveal! Even more, imagine having your own treasure chest, and as you raise the lid, a beautiful golden light emerges, revealing five sparkling jewels. As you read each chapter, imagine holding one of these beautiful jewels in your hand. As you study the jewel's brilliance coupled with the themes in each chapter, it is my hope that you, too, will discover a treasure trove of jewels that embody the golden years!"
  }
}